

# parameters
nc: 1  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]   # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 三流多模态融合架构
backbone:
  # [from, number, module, args]
  [
    ######### RGB流 #############
    [-1, 1, Focus, [64, 3]],    # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],         # 2-P2/4
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 9, C3, [256]],         # 4-P3/8
    
    ######### IR流 #############
    [-4, 1, Focus, [64, 3]],    # 5-P1/2  # -4表示使用另一个输入(IR)
    [-1, 1, Conv, [128, 3, 2]], # 6-P2/4
    [-1, 3, C3, [128]],         # 7-P2/4
    [-1, 1, Conv, [256, 3, 2]], # 8-P3/8
    [-1, 9, C3, [256]],         # 9-P3/8
    
    ######### 事件流 #############
    [-5, 1, Eventpooling, [[64, 256, 256], 3, 4, 4, [3, 5, 7, 9], [1, 2, 3, 4], 1]],  # 10-Event preprocessing
    [-1, 9, C3, [256]],         # 11-P3/8 (预处理后的事件特征)
    
    ######### P3层级特征融合 - 使用事件感知融合 #############
    [[4,9,11], 1, AdaptiveMobileViTFusion, [256, 2, 4, 2]],  # 12-P3/8 三流融合#ATMF is here
    
    # 为每个流添加残差连接
    [[4,12], 1, Add2, [256,0]],    # 13-P3/8 RGB+融合
    [[9,12], 1, Add2, [256,1]],    # 14-P3/8 IR+融合
    [[11,12], 1, Add2, [256,2]],   # 15-P3/8 Event+融合
    
    ######### P4层级特征提取和融合 #############
    # RGB流
    [13, 1, Conv, [512, 3, 2]],    # 16-P4/16
    [-1, 9, C3, [512]],            # 17-P4/16
    
    # IR流
    [14, 1, Conv, [512, 3, 2]],    # 18-P4/16
    [-1, 9, C3, [512]],            # 19-P4/16
    
    # 事件流
    [15, 1, Conv, [512, 3, 2]],    # 20-P4/16
    [-1, 9, C3, [512]],            # 21-P4/16
    
    # 三流融合 - P4层级
    [[17,19,21], 1, AdaptiveMobileViTFusion, [512, 2, 4, 2]],  # 22-P4/16
    
    # 为每个流添加残差连接
    [[17,22], 1, Add2, [512,0]],   # 23-P4/16 RGB+融合
    [[19,22], 1, Add2, [512,1]],   # 24-P4/16 IR+融合
    [[21,22], 1, Add2, [512,2]],   # 25-P4/16 Event+融合
    
    ######### P5层级特征提取和融合 #############
    # RGB流
    [23, 1, Conv, [1024, 3, 2]],    # 26-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],  # 27-P5/32
    [-1, 3, C3, [1024, False]],     # 28-P5/32
    
    # IR流
    [24, 1, Conv, [1024, 3, 2]],    # 29-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],  # 30-P5/32
    [-1, 3, C3, [1024, False]],     # 31-P5/32
    
    # 事件流
    [25, 1, Conv, [1024, 3, 2]],    # 32-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],  # 33-P5/32
    [-1, 3, C3, [1024, False]],     # 34-P5/32
    
    # 三流融合 - P5层级
    [[28,31,34], 1, AdaptiveMobileViTFusion,[1024, 2, 8, 2]],  # 35-P5/32
    
    # 为每个流添加残差连接
    [[28,35], 1, Add2, [1024,0]],   # 36-P5/32 RGB+融合
    [[31,35], 1, Add2, [1024,1]],   # 37-P5/32 IR+融合
    [[34,35], 1, Add2, [1024,2]],   # 38-P5/32 Event+融合
    
    ######### 最终特征融合 #############
    [[13,14,15], 1, Add, [3]],     # 39-P3/8 加权融合P3特征
    [[23,24,25], 1, Add, [3]],     # 40-P4/16 加权融合P4特征
    [[36,37,38], 1, Add, [3]],     # 41-P5/32 加权融合P5特征
  ]

# 检测头 - 与原始保持一致
head:
  [
    [-1, 1, Conv, [512, 1, 1]],                    # 42
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 43
    [[-1,40], 1, Concat, [1]],                     # 44 连接P4特征
    [-1, 3, C3, [512, False]],                     # 45
    
    [-1, 1, Conv, [256, 1, 1]],                    # 46
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 47
    [[-1,39], 1, Concat, [1]],                     # 48 连接P3特征
    [-1, 3, C3, [256, False]],                     # 49 (P3/8-small)
    
    [-1, 1, Conv, [256, 3, 2]],                    # 50
    [[-1,45], 1, Concat, [1]],                     # 51 cat head P4
    [-1, 3, C3, [512, False]],                     # 52 (P4/16-medium)
    
    [-1, 1, Conv, [512, 3, 2]],                    # 53
    [[-1,42], 1, Concat, [1]],                     # 54 cat head P5
    [-1, 3, C3, [1024, False]],                    # 55 (P5/32-large)
    
    [[49, 52, 55], 1, Detect, [nc, anchors]],      # Detect(P3, P4, P5)
  ]
